import React from "react";
import Header from "../Header";
import { Container, Button } from "reactstrap";
import { Link } from "react-router-dom";
const Aboutresult = () => {
  return (
    <div className="technicalterms-page">
      <Header />
      <Container>
        <div className="technicalterms-component">
          <h1>เกณฑ์ในการแปลความหมายคะแนน T-Score</h1>
          <hr />
          <div>
            <h3>แบบประเมินพัฒนาการด้านการคิดเชิงบริหาร (MU.EF-101)</h3>
            <p>
              คะแนน T-Score >60 หมายถึง สูงกว่าเกณฑ์เฉลี่ยมาก (ดีมาก)
              ควรรักษาพฤติกรรมนี้ให้คงไว้ และให้โอกาสเด็กฝึกใช้ทักษะ EF สม่ำเสมอ
            </p>
            <p>
              คะแนน T-Score 56-60 หมายถึง สูงกว่าเกณฑ์เฉลี่ย (ดี)
              ควรรักษาพฤติกรรมนี้ให้คงไว้ และให้โอกาสเด็กฝึกใช้ทักษะ EF สม่ำเสมอ
            </p>
            <p>
              คะแนนT-Score 45-55 หมายถึง อยู่ในเกณฑ์เฉลี่ย (ปานกลาง)
              ควรส่งเสริมและรักษาพฤติกรรมนี้ให้คงไว้
            </p>
            <p>
              คะแนน T-Score 40-44 หมายถึง เริ่มต่ำกว่าเกณฑ์เฉลี่ยเล็กน้อย
              (ควรพัฒนา)
              เด็กควรได้รับการพัฒนาการคิดเชิงบริหารในด้านนั้นๆให้ดียิ่งขึ้น
              ครูและพ่อแม่ควรเอาใจใส่ในการส่งเสริมพัฒนาการด้าน EF ในด้านนั้นๆ
              เพื่อให้เด็กมีพัฒนาการด้าน EF ที่ดีตามวัย
            </p>
            <p>
              คะแนน T-Score &lt; 40 หมายถึง ต่ำกว่าเกณฑ์เฉลี่ยมาก (ควรปรับปรุง)
              เด็กจำเป็นต้องได้รับการส่งเสริมเพื่อพัฒนาการคิดเชิงบริหารในด้านนั้นอย่างเร่งด่วน
              ครูและพ่อแม่ควรเอาใจใส่ในการส่งเสริมพัฒนาการด้าน EF
              ในด้านนั้นๆอย่างจริงจังและสม่ำเสมอ เพื่อให้เด็กมีพัฒนาการด้าน EF
              ใกล้เคียงกับเกณฑ์ของเด็กวัยเดียวกัน
            </p>
          </div>
          <div className="mt-4">
            <h3>
              แบบประเมินปัญหาพฤติกรรมที่เป็นความบกพร่องด้านการคิดเชิงบริหาร
              (MU.EF-102)
            </h3>
            <p>
              คะแนน T-Score > 60 หมายถึง คะแนนปัญหาพฤติกรรมสูงกว่าเกณฑ์เฉลี่ยมาก
              (มีปัญหามาก)
              จำเป็นต้องได้รับการปรับแก้พฤติกรรมด้านที่เป็นปัญหาอย่างเร่งด่วน
              ครูและพ่อแม่ควรเอาใจใส่ในการปรับแก้พฤติกรรมเด็กอย่างจริงจังและสม่ำเสมอ
              เพื่อให้เด็กมีปัญหาพฤติกรรมที่เป็นความบกพร่องของ EF ลดลง
              และช่วยให้เด็กมีความพร้อมทางการเรียนมากขึ้น
            </p>
            <p>
              คะแนน T-Score 56-60 หมายถึง
              คะแนนปัญหาพฤติกรรมสูงกว่าเกณฑ์เฉลี่ยเล็กน้อย (เริ่มมีปัญหา)
              เด็กควรได้รับการพัฒนา EF ในด้านนั้นๆ
              ครูและพ่อแม่ควรเอาใจใส่ส่งเสริมพัฒนาการด้าน EF
              ของเด็กเพื่อให้เด็กมีพัฒนาการด้าน EF ที่ดีตามวัย
            </p>
            <p>
              คะแนน T-Score 45-55 หมายถึง
              คะแนนปัญหาพฤติกรรมอยู่ในเกณฑ์เฉลี่ยของเด็กวัยเดียวกัน (ปานกลาง)
              ควรพัฒนา EF ในด้านนั้นๆอย่างสม่ำเสมอและต่อเนื่อง
              มีโอกาสที่จะพัฒนาให้ดีขึ้นได้อีก
            </p>
            <p>
              คะแนน T-Score 45-55 หมายถึง
              คะแนนปัญหาพฤติกรรมอยู่ในเกณฑ์เฉลี่ยของเด็กวัยเดียวกัน (ปานกลาง)
              ควรพัฒนา EF ในด้านนั้นๆอย่างสม่ำเสมอและต่อเนื่อง
              มีโอกาสที่จะพัฒนาให้ดีขึ้นได้อีก
            </p>
            <p>
              คะแนน T-Score &lt; 40 หมายถึง
              คะแนนปัญหาพฤติกรรมน้อยกว่าเกณฑ์เฉลี่ยมาก (ไม่มีปัญหาเลย)
              หมายถึงเด็กไม่มีปัญหาพฤติกรรมที่เป็นความบกพร่องด้านการคิดเชิงบริหาร
              ควรรักษาพฤติกรรมนี้ให้คงไว้ และให้โอกาสเด็กฝึกใช้ทักษะ EF สม่ำเสมอ
            </p>
          </div>
          <div className="mt-4">
            <h3>
              คะแนนทักษะพื้นฐาน 5 ด้าน
              เป็นตัวบ่งชี้ความสามารถในการกำกับตนเองไปสู่เป้าหมาย ดังนี้
            </h3>
            <p>
              ทักษะด้านการหยุดพฤติกรรม + การควบคุมอารมณ์
              เป็นตัวบ่งชี้ความสามารถในการยับยั้งควบคุมตนเอง (Inhibitory
              Self-Control)
            </p>
            <p>
              ทักษะด้านการเปลี่ยน + การควบคุมอารมณ์
              เป็นตัวบ่งชี้ความสามารถในการคิดยืดหยุ่น (Cognitive Flexibility)
            </p>
            <p>
              ทักษะด้านความจำขณะทำงาน + การวางแผนจัดการ
              เป็นตัวบ่งชี้ความสามารถด้านพุทธิปัญญา (Metacognition)
            </p>
          </div>
          <div className="back-to-home">
            <Link to="/">
              <Button color="light">กลับสู่หน้าหลัก</Button>
            </Link>
          </div>
        </div>
      </Container>
    </div>
  );
};

export default Aboutresult;
