import React from "react";
import Header from "../Header";
import { Container, Button } from "reactstrap";
import { Link } from "react-router-dom";
const Aboutresult = () => {
  return (
    <div className="technicalterms-page">
      <Header />
      <Container>
        <div className="technicalterms-component">
          <h1>เกณฑ์ในการแปลความหมายคะแนน T-Score</h1>
          <hr />
          <div>
            <h3>เกณฑ์ในการแปลผลคะแนนที แบบประเมิน MU.EF-101</h3>
            <p>
              T-Score &gt; 60 หมายถึง สูงกว่าเกณฑ์เฉลี่ยมาก (ดีมาก)
              ควรส่งเสริมและรักษาพฤติกรรมนี้ให้คงไว้
            </p>
            <p>
              T-Score 56-60 หมายถึง สูงกว่าเกณฑ์เฉลี่ย (ดี)
              ควรส่งเสริมและรักษาพฤติกรรมนี้ให้คงไว้ และพัฒนาให้ดียิ่งขึ้นไป
            </p>
            <p>
              T-Score 45-55 หมายถึงอยู่ในเกณฑ์เฉลี่ย (ปานกลาง)
              ควรรักษาพฤติกรรมนี้ให้คงไว้ และยังมีโอกาสพัฒนาให้ดีขึ้นได้อีก
            </p>
            <p>
              T-Score 40-44 หมายถึง ต่ำกว่าเกณฑ์เฉลี่ยเล็กน้อย (ควรพัฒนา)
              เด็กควรได้รับการพัฒนาการคิดเชิงบริหารด้านนั้นๆให้ดียิ่งขึ้น
              ครูและพ่อแม่ควรเอาใจใส่ในการส่งเสริมพัฒนาการด้าน EF
              ของเด็กอย่างสม่ำเสมอเพื่อให้มีพัฒนาการด้าน EF ตามวัย
            </p>
            <p>
              T-Score &lt; 40 หมายถึง ต่ำกว่าเกณฑ์เฉลี่ยมาก (ควรปรับปรุง)
              เด็กจำเป็นต้องได้รับการส่งเสริมพัฒนาการคิดเชิงบริหารอย่างเร่งด่วน
              ครูและพ่อแม่ควรเอาใจใส่ในการส่งเสริมพัฒนาการด้านการคิดเชิงบริหารของเด็กอย่างจริงจังและสม่ำเสมอ
              เพื่อให้เด็กมีพัฒนาการด้าน EF ตามเกณฑ์ของเด็กวัยเดียวกัน
            </p>
          </div>
          <div className="mt-4">
            <h3>เกณฑ์ในการแปลผลคะแนนที แบบประเมิน MU.EF-102</h3>
            <p>
              T-Score &gt; 60 หมายถึง มีปัญหาพฤติกรรมสูงกว่าเกณฑ์เฉลี่ยมาก
              (มีปัญหามาก)
              จำเป็นต้องได้รับการปรับแก้พฤติกรรมที่เป็นปัญหาอย่างเร่งด่วน
              ครูและพ่อแม่ควรเอาใจใส่ในการปรับแก้พฤติกรรมเด็กอย่างจริงจังและสม่ำเสมอ
              เพื่อช่วยให้เด็กมีความพร้อมทางการเรียนมากขึ้น
            </p>
            <p>
              T-Score 56-60 หมายถึง
              เริ่มมีปัญหาพฤติกรรมสูงกว่าเกณฑ์เฉลี่ยเล็กน้อย (เริ่มมีปัญหา)
              ครูและพ่อแม่ควรเอาใจใส่ส่งเสริมพัฒนาการ EF
              ด้านที่เริ่มมีปัญหาเพื่อช่วยให้เด็กมีพัฒนาการด้าน EF ตามวัย
            </p>
            <p>
              T-Score 45-55 หมายถึง มีปัญหาพฤติกรรมอยู่ในเกณฑ์เฉลี่ย (ปานกลาง)
              ควรส่งเสริมพัฒนา EF อย่างสม่ำเสมอและต่อเนื่อง
              และยังมีโอกาสที่จะพัฒนาให้ดีขึ้นได้อีก
            </p>
            <p>
              T-Score 40-44 หมายถึง มีปัญหาพฤติกรรมน้อยกว่าเกณฑ์เฉลี่ย
              (แทบไม่มีปัญหา)
              หมายถึงเด็กแทบไม่มีปัญหาพฤติกรรมที่เป็นความบกพร่องด้านการคิดเชิงบริหาร
              ควรรักษาพฤติกรรมนี้ให้คงไว้ และควรให้โอกาสเด็กฝึกใช้ทักษะ EF
              อย่างต่อเนื่อง
            </p>
            <p>
              T-Score &lt; 40 หมายถึง มีปัญหาพฤติกรรมน้อยกว่าเกณฑ์เฉลี่ยมาก
              (ไม่มีปัญหาเลย)
              หมายถึงเด็กไม่มีปัญหาพฤติกรรมที่เป็นความบกพร่องด้านการคิดเชิงบริหารเลย
              ควรรักษาพฤติกรรมนี้ให้คงไว้ ควรฝึกเด็กให้ใช้ทักษะ EF
              อย่างต่อเนื่อง
            </p>
          </div>
          <div className="mt-4">
            <h3>
              คะแนนดิบของทักษะพื้นฐาน 5 ด้าน
              สามารถนำมาคำณวนคะแนนดิบของตัวบ่งชี้ความสามารถในการกำกับตนเองไปสู่เป้าหมาย
              ดังนี้ (การแปลผลต้องนำไปเทียบกับคะแนนทีจากตารางเทียบคะแนน)
            </h3>
            <p>
              1. ตัวบ่งชี้ความสามารถในการยับยั้งควบคุมตนเอง (Inhibitory
              Self-Control) = คะแนนด้านการหยุด พฤติกรรม +
              คะแนนด้านการควบคุมอารมณ์
            </p>
            <p>
              2. ตัวบ่งชี้ความสามารถในการคิดยืดหยุ่น (Cognitive Flexibility) =
              คะแนนด้านการเปลี่ยน + คะแนนด้านการควบคุมอารมณ์
            </p>
            <p>
              3. ตัวบ่งชี้ความสามารถด้านอภิปัญญา (Metacognition) =
              คะแนนดิบด้านความจำขณะทำงาน + คะแนนดิบด้านการวางแผนจัดการ
            </p>
            <p>
              4. คะแนนดิบทั้ง 5 ด้านเมื่อนำมารวมกันจะได้เป็น คะแนนรวมทักษะด้าน
              EF ของเด็ก
            </p>
          </div>
          <div className="back-to-home">
            <Link to="/">
              <Button color="light">กลับสู่หน้าหลัก</Button>
            </Link>
          </div>
        </div>
      </Container>
    </div>
  );
};

export default Aboutresult;
