import React from "react";
import Header from "../Header";
import { Container, Button, Table } from "reactstrap";
import { Link } from "react-router-dom";
const Technicalterms = () => {
  return (
    <div className="technicalterms-page">
      <Header />
      <Container>
        <div className="technicalterms-component">
          <h1>คำนิยามศัพท์</h1>
          <hr />
          <div className="meaing-table">
            <Table>
              <thead>
                <tr>
                  <th>คำศัพท์</th>
                  <th>ความหมาย</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>เด็กปฐมวัย </td>
                  <td>
                    หมายถึงเด็กที่มีอายุตั้งแต่แรกเกิดจนถึง 8 ปีบริบูรณ์
                    การศึกษาปฐมวัยจึงครอบคลุมตั้งแต่ระดับชั้นก่อนอนุบาล
                    ชั้นอนุบาล และชั้นประถมศึกษาปีที่ 1-2
                    ในคู่มือเล่มนี้เด็กปฐมวัยหมายถึงเด็กที่มีอายุระหว่าง 2-6 ปี
                    แบ่งเป็น 2 ระยะคือ วัยเด็กเล็กหรือวัยเตาะแตะ (อายุ 2-3 ปี)
                    และวัยอนุบาล (อายุ 3-6 ปี)
                  </td>
                </tr>
                <tr>
                  <td>การคิดเชิงบริหาร หรือ Executive Functions</td>
                  <td>
                    เป็นการทำหน้าที่ระดับสูงของสมองในการควบคุมความคิด อารมณ์
                    การกระทำ จนทำให้เกิดพฤติกรรมที่มุ่งสู่เป้าหมาย (Goal
                    directed behaviors) ในเด็กวัย 2-6 ปี EF
                    ประกอบด้วยทักษะพื้นฐาน 5 ด้านคือ Working memory
                    (ความจำขณะทำงาน) Inhibitory control
                    (การหยุดการยับยั้งพฤติกรรม) และ Shift/Cognitive flexibility
                    (การเปลี่ยน/การยืดหยุ่นทางความคิด) Emotional control
                    (การควบคุมอารมณ์) และ Plan/Organize (การวางแผนจัดการ)
                  </td>
                </tr>
                <tr>
                  <td>ความจำขณะทำงาน (Working memory)</td>
                  <td>
                    หมายถึงความสามารถในการจำข้อมูลไว้ในใจและจัดการข้อมูลกับเหล่านั้นเพื่อทำความเข้าใจกับสิ่งต่างๆ
                    เพื่อคิดแก้ปัญหา จำเป็นต้องอาศัยการมีความสนใจจดจ่อ
                    (attention) เป็นพื้นฐานสำคัญ
                  </td>
                </tr>
                <tr>
                  <td>การหยุด การยับยั้งพฤติกรรม (Inhibitory control)</td>
                  <td>
                    หมายถึง การหยุดพฤติกรรมที่เคยชิน หยุดคิดก่อนทำ
                    ไม่หุนหันพลันแล่น
                    หยุดพฤติกรรมที่รบกวนผู้อื่นหรือทำให้ผู้อื่นเดือดร้อน
                    รวมถึงการควบคุมความคิดให้จดจ่อกับงานที่ทำ
                    หยุดคิดเรื่องอื่นที่ไม่เกี่ยวข้อง
                  </td>
                </tr>
                <tr>
                  <td>
                    การเปลี่ยน/การยืดหยุ่นทางความคิด (Shift/Cognitive
                    flexibility)
                  </td>
                  <td>
                    หมายถึงการเปลี่ยนสลับความสนใจจากสิ่งหนึ่งไปยังอีกสิ่งหนึ่งได้
                    การเปลี่ยนความคิดได้ไม่ยึดติดความคิดเดียว การคิดนอกกรอบ
                    ความสามารถในการคิดยืดหยุ่นจะพัฒนาช้ากว่าความจำขณะทำงานและการยังยั้บพฤติกรรม
                  </td>
                </tr>
                <tr>
                  <td>การควบคุมอารมณ์ (Emotional control)</td>
                  <td>
                    หมายถึงความสามารถในการจัดการกับอารมณ์ความรู้สึกที่เกิดขึ้น
                    โดยการแสดงออกหรือตอบสนองทางอารมณ์ได้อย่างเหมาะสมกับสถานการณ์
                  </td>
                </tr>
                <tr>
                  <td>การวางแผนจัดการ (Plan/Organize)</td>
                  <td>
                    หมายถึงการวางแผนจัดการงาน เริ่มตั้งแต่การมีเป้าหมาย
                    การจัดลำดับความสำคัญของงาน การเริ่มต้นลงมือทำ
                    การทำงานให้เสร็จ การแก้ปัญหา
                    การไม่ติดกับปัญหาเล็กน้อยจนทำให้งานไม่เสร็จ
                    การติดตามสะท้อนผลของงานเพื่อปรับปรุงให้ดีขึ้น
                  </td>
                </tr>
                <tr>
                  <td>การกำกับควบคุมตนเอง (Inhibitory Self-Control)</td>
                  <td>
                    หมายถึงความสามารถในการตอบสนองทางอารมณ์และพฤติกรรมได้อย่างเหมาะสมโดยผ่านกระบวนการยับยั้งควบคุมตนเอง
                    ตัวชี้วัดด้านการกำกับควบคุมตนเองนี้เป็นพื้นฐานที่สำคัญมากเนื่องจากการกำกับควบคุมตนเองได้จะช่วยส่งเสริมให้เด็กนำเมตาคอกนิชั่นมาใช้ในการทำงานให้สำเร็จต่อไป
                    การกำกับควบคุมตนเองต้องอาศัยทักษะด้านการหยุดการยับยั้งพฤติกรรม
                    (Inhibit) ร่วมกับ การควบคุมอารมณ์ (Emotional control)
                  </td>
                </tr>
                <tr>
                  <td>ความยืดหยุ่น (Flexibility)</td>
                  <td>
                    หมายถึงความสามารถในการปรับเปลี่ยนความคิดที่ส่งผลต่อการตอบสนองทางอารมณ์และพฤติกรรม
                    ซึ่งมีความสำคัญในการที่เด็กปรับอารมณ์และพฤติกรรมให้เหมาะสมกับสถานการณ์
                    ความยืดหยุ่นต้องอาศัยความทักษะด้านการเปลี่ยน/การยืดหยุ่นทางความคิด
                    (Shift) ร่วมกับ การควบคุมอารมณ์ (Emotional control)
                  </td>
                </tr>
                <tr>
                  <td>เมตาคอกนิชัน (Metacognition)</td>
                  <td>
                    หมายถึงความสามารถของบุคคลในการตระหนักรู้เกี่ยวกับความรู้
                    ความคิด และความสามารถของตนเอง เช่น รู้ว่าตนเองรู้อะไร
                    รู้ว่าตนเองคิดอย่างไร
                    รู้ว่าต้องใช้วิธีการอย่างไรในการทำงานให้เสร็จ
                    เมตาคอกนิชันต้องอาศัยความจำขณะทำงาน (Working memory) ร่วมกับ
                    การวางแผนจัดการ (Plan/Organize)
                  </td>
                </tr>
                <tr>
                  <td>การคิดเชิงบริหารโดยรวม</td>
                  <td>
                    หมายถึงทักษะการคิดเชิงบริหารในภาพรวม
                    ได้มาจากการนำคะแนนของตัวบ่งชี้รายด้าน 5 ด้านมารวมกัน
                  </td>
                </tr>
                <tr>
                  <td>คะแนนดิบ (Raw Score)</td>
                  <td>
                    คือคะแนนที่ได้จากการวัดด้วยแบบประเมิน
                    ยังไม่สามารถบอกความหมายของคะแนนได้เนื่องจากทักษะด้าน EF
                    ขึ้นกับเพศและอายุของเด็ก
                    จึงต้องนำคะแนนดิบไปเทียบตารางให้เป็นคะแนนมาตรฐานที เสียก่อน
                    จึงจะสามารถแปลความหมายของผลประเมินได้
                  </td>
                </tr>
                <tr>
                  <td>คะแนนมาตรฐานที (T-Score)</td>
                  <td>
                    คือคะแนนที่มีค่าเฉลี่ย 50 และมีค่าเบี่ยงเบนมาตรฐาน 10
                    โดยยังมีลักษณะการกระจายของข้อมูลเหมือนกับการกระจายของคะแนนดิบ
                    คะแนนมาตรฐานทีเป็นคะแนนที่แปลงรูปมาจากคะแนนดิบเพื่อให้สามารถแปลความหมายได้เช่น
                    ช่วงคะแนนที่อยู่ในเกณฑ์มาตรฐาน สูงกว่าเกณฑ์ หรือต่ำกว่าเกณฑ์
                    เป็นต้น
                  </td>
                </tr>
                <tr>
                  <td>เปอร์เซ็นต์ไทล์ (Percentile)</td>
                  <td>
                    คือตำแหน่งที่บอกว่า
                    เมื่อเทียบกับเด็กหนึ่งร้อยคนจะมีผู้ทำคะแนนได้น้อยกว่าหรือเท่ากับตำแหน่งนี้อยู่กี่คน
                    เช่น Percentile 50 คือมีผู้ทำคะแนนได้น้อยกว่าอยู่ 50
                    คนจากทั้งหมด 100 คน
                  </td>
                </tr>
              </tbody>
            </Table>
          </div>
          <div className="back-to-home">
            <Link to="/">
              <Button color="light">กลับสู่หน้าหลัก</Button>
            </Link>
          </div>
        </div>
      </Container>
    </div>
  );
};

export default Technicalterms;
