import React from "react";
import Header from "../Header";
import { Container, Button, Table } from "reactstrap";
import { Link } from "react-router-dom";
const Technicalterms = () => {
  return (
    <div className="technicalterms-page">
      <Header />
      <Container>
        <div className="technicalterms-component">
          <h1>คำนิยามศัพท์</h1>
          <hr />
          <div className="meaing-table">
            <Table>
              <thead>
                <tr>
                  <th>คำศัพท์</th>
                  <th>ความหมาย</th>
                </tr>
              </thead>
              <tbody>
                <tr>
                  <td>การคิดเชิงบริหาร หรือ Executive Functions (EF)</td>
                  <td>
                    เป็นการทำหน้าที่ระดับสูงของสมองที่ช่วยให้เราควบคุมอารมณ์
                    ความคิด และการกระทำ จนเกิดพฤติกรรมที่มุ่งสู่เป้าหมาย (Goal
                    directed behaviors) ประกอบด้วยทักษะพื้นฐาน 5 ด้าน
                  </td>
                </tr>
                <tr>
                  <td>การหยุด การยับยั้งพฤติกรรม (Inhibitory control)</td>
                  <td>
                    การยับยั้งพฤติกรรมตนเองไม่หุนหันพลันแล่น หยุดคิดก่อนทำ
                    หยุดพฤติกรรมที่รบกวนผู้อื่นหรือทำให้ผู้อื่นเดือดร้อน
                    รวมถึงการยับยั้งความคิดไม่ให้คิดเรื่อยเปื่อยในเรื่องที่ไม่เกี่ยวข้อง
                    ควบคุมความคิดให้มีสมาธิจดจ่อในเรื่องที่กำลังทำ
                  </td>
                </tr>
                <tr>
                  <td>
                    การเปลี่ยน/ความยืดหยุ่นในการคิด (Shift/Cognitive
                    flexibility)
                  </td>
                  <td>
                    เปลี่ยนความคิดได้ไม่ยึดติดความคิดเดียว
                    รู้จักเปลี่ยนมุมมองคิดนอกกรอบได้
                    สามารถทำงานหลายอย่างสลับไปมาได้
                    ความสามารถในการคิดยืดหยุ่นจะพัฒนาช้ากว่าความจำขณะทำงานและการยังยั้บพฤติกรรม
                  </td>
                </tr>
                <tr>
                  <td>การควบคุมอารมณ์ (Emotional control)</td>
                  <td>
                    ความสามารถในการควบคุมอารมณ์ให้แสดงออกอย่างเหมาะสมตามสถานการณ์
                  </td>
                </tr>
                <tr>
                  <td>ความจำขณะทำงาน (Working memory)</td>
                  <td>
                    ความสามารถในการจำข้อมูลไว้ในใจและจัดการข้อมูลกับเหล่านั้นเพื่อทำความเข้าใจกับสิ่งต่างๆ
                    เพื่อคิดแก้ปัญหา จำเป็นต้องอาศัยการมีความตั้งใจจดจ่อ
                    (attention) เป็นพื้นฐาน
                  </td>
                </tr>
                <tr>
                  <td>การวางแผนจัดการ (Plan/Organize)</td>
                  <td>
                    การวางแผนจัดการงานให้เสร็จ ตั้งแต่การตั้งเป้าหมาย
                    จัดลำดับความสำคัญของงาน เริ่มต้นลงมือทำ
                    การไม่ติดกับปัญหาเล็กน้อยจนลืมภาพรวมของงาน
                    การคาดการณ์ผลของการกระทำ
                    การติดตามสะท้อนผลจากการกระทำเพื่อปรับปรุงงานให้ดีขึ้น
                  </td>
                </tr>
                <tr>
                  <td>การยับยั้งควบคุมตนเอง (Inhibitory Self-Control)</td>
                  <td>
                    ความสามารถในการปรับเปลี่ยนการตอบสนอง อารมณ์ และพฤติกรรม
                    ให้เหมาะสมโดยผ่านการควบคุมยับยั้งตนเอง
                    ตัวชี้วัดนี้เป็นพื้นฐานที่สำคัญมากเนื่องจากการควบคุมตนเองให้หยุดได้จะช่วยส่งเสริมให้เด็กนำพุทธิปัญญามาใช้ในการแก้ปัญหาจนประสบความสำเร็จได้
                    การกำกับควบคุมตนเองต้องอาศัยทักษะด้านการ Inhibit ร่วมกับ
                    Emotional control
                  </td>
                </tr>
                <tr>
                  <td>การคิดยืดหยุ่น (Cognitive Flexibility)</td>
                  <td>
                    ความสามารถในการคิดที่ปรับเปลี่ยนได้ส่งผลต่อความยืดหยุ่นในการกระทำ
                    การตอบสนองทางอารมณ์และพฤติกรรม
                    การคิดยืดหยุ่นมีควาสำคัญในการที่เด็กปรับเปลี่ยนการกระทำ
                    อารมณ์ และพฤติกรรม
                    ให้เหมาะสมตามสถานการณ์สิ่งแวดล้อมที่เปลี่ยนไปได้
                    การคิดยืดหยุ่นต้องอาศัยความทักษะด้าน Shift ร่วมกับ Emotional
                    control
                  </td>
                </tr>
                <tr>
                  <td>พุทธิปัญญา (Metacognition)</td>
                  <td>
                    ความสามารถในการควบคุมกำกับกระบวนการทางปัญญาและความคิดของตนเองให้ตระหนักรู้ในงานและใช้ยุทธวิธีต่างๆในการแก้ปัญหาจนทำงานสำเร็จ
                    เด็กต้องใช้ทักษะด้านพุทธิปัญญาในการพัฒนาตนเองให้เป็นคนที่มีประสิทธิภาพ
                    พุทธิปัญญาต้องอาศัยทักษะด้าน Working memory ร่วมกับ
                    Plan/Organize
                  </td>
                </tr>
                <tr>
                  <td>การคิดเชิงบริหารโดยรวม</td>
                  <td>
                    ทักษะการคิดเชิงบริหารในภาพรวม
                    ได้มาจากการนำคะแนนดิบของตัวบ่งชี้รายด้าน 5 ด้านมารวมกัน
                  </td>
                </tr>
                <tr>
                  <td>คะแนนดิบ (Raw Score)</td>
                  <td>
                    คะแนนที่ได้จากการวัดด้วยแบบประเมิน
                    ยังไม่สามารถบอกความหมายของคะแนนได้ชัดเจนนัก
                    จะต้องเปลี่ยนคะแนนดิบให้เป็นคะแนนมาตรฐานเสียก่อนจึงจะสามารถนำมาเปรียบเทียบกันให้มีความหมายได้และนำไปใช้ประโยชน์แก่ตัวเด็กหรือครูได้
                  </td>
                </tr>
                <tr>
                  <td>คะแนนมาตรฐานที (T-Score)</td>
                  <td>
                    คือ
                    คะแนนที่แปลงรูปมาจากคะแนนดิบเพื่อให้มีความหมายชัดเจนยิ่งขึ้น
                    คะแนนมาตรฐานทีมีค่าเฉลี่ย 50 และมีค่าเบี่ยงเบนมาตรฐาน 10
                    โดยยังมีลักษณะการกระจายของข้อมูลเหมือนกับการกระจายของคะแนนดิบ
                  </td>
                </tr>
                <tr>
                  <td>ตำแหน่งเปอร์เซ็นต์ไทล์ (Percentile)</td>
                  <td>
                    ตำแหน่งที่บอกว่าเมื่อเทียบจากร้อยคนจะมีผู้ทำคะแนนได้น้อยกว่าหรือเท่ากับตำแหน่งนี้กี่คน
                    เช่น Percentile 50 คือค่าที่มีจำนวนข้อมูลน้อยกว่านี้อยู่ 50
                    คนจากทั้งหมด 100 คน
                  </td>
                </tr>
              </tbody>
            </Table>
          </div>
          <div className="back-to-home">
            <Link to="/">
              <Button color="light">กลับสู่หน้าหลัก</Button>
            </Link>
          </div>
        </div>
      </Container>
    </div>
  );
};

export default Technicalterms;
